# 데이터프레임과 시리즈

In [1]:
import pandas as pd

In [3]:
s = pd.Series(['banana', 42])
s

0    banana
1        42
dtype: object

In [4]:
s = pd.Series(['Wes Mckinney', 'Creator of Pandas'], index=['Person', 'Who'])
s

Person         Wes Mckinney
Who       Creator of Pandas
dtype: object

In [20]:
scientists = pd.DataFrame({
    'Name': ['Rosaline Franklin', 'William Gosset'],
    'Occupation': ['Chemist', 'Statistician'],
    'Born': ['1920-07-25', '1876-06-13'], 
    'Died': ['1958-04-16', '1937-10-16'], 
    'Age': [37, 61]
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [8]:
from collections import OrderedDict

In [19]:
scientists = pd.DataFrame(
    OrderedDict([
        ('Name', ['Rosaline Franklin', 'William Gosset']),
        ('Occupation', ['Chemist', 'Statistician']),
        ('Born', ['1920-07-25', '1876-06-13']), 
        ('Died', ['1958-04-16', '1937-10-16']), 
        ('Age', [37, 61])
    ])
)
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [25]:
scientists = pd.DataFrame(
    data= {
        'Occupation': ['Chemist', 'Statistician'],
        'Born': ['1920-07-25', '1876-06-13'], 
        'Died': ['1958-04-16', '1937-10-16'], 
        'Age': [37, 61]
    },
    index = ['Rosaline Franklin', 'William Gosset'],
    columns = ['Occupation', 'Age', 'Born', 'Died']
)
scientists

                     Occupation  Age        Born        Died
Rosaline Franklin       Chemist   37  1920-07-25  1958-04-16
William Gosset     Statistician   61  1876-06-13  1937-10-16

In [28]:
first_row = scientists.loc['William Gosset'] 
print(type(first_row)) #시리즈로 선택해올때 정수형이 아닌 변수형으로 추출
first_row

<class 'pandas.core.series.Series'>

Occupation    Statistician
Age                     61
Born            1876-06-13
Died            1937-10-16
Name: William Gosset, dtype: object

In [34]:
first_row.index
#first_row.index[0]

Index(['Occupation', 'Age', 'Born', 'Died'], dtype='object')

In [36]:
first_row.keys() #index 속성과 같음
#first_row.keys()[0]

Index(['Occupation', 'Age', 'Born', 'Died'], dtype='object')

## 기초 통계 메서드

In [44]:
ages = scientists['Age']
type(ages); ages

print(ages)
ages.mean()
ages.min()
ages.max()
ages.std()

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

16.97056274847714

# 시리즈 메서드

In [46]:
scientists = pd.read_csv('../data/pandas/scientists.csv')
ages = scientists['Age']

In [47]:
print(ages.max())
print(ages.mean())

90
59.125

# 불린 추출

In [49]:
#시리즈 불린 추출
print(ages > ages.mean()); print()
print(ages[ages > ages.mean()])

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [50]:
#시리즈는 백터의 한종류
print(ages + ages)
print(ages * ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [52]:
#시리즈와 브로드캐스팅 : 백터와 스칼라의 연산
print(ages + 100)
print(ages * 100)

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64
0    3700
1    6100
2    9000
3    6600
4    5600
5    4500
6    4100
7    7700
Name: Age, dtype: int64

In [55]:
#길이가 다른 백터의 연산 => 같은 인덱스만 계산되고 나머지는 누락값 처리(NaN)
print(pd.Series([1, 100])); print()
print(ages + pd.Series([1, 100])); print()

0      1
1    100
dtype: int64

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [59]:
ages.sort_index(ascending=False)

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [60]:
#데이터프레임 불린 추출
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [61]:
scientists.loc[[True, True, False, True, True, False, True, True]]

                Name        Born        Died  Age          Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1     William Gosset  1876-06-13  1937-10-16   61        Statistician
3        Marie Curie  1867-11-07  1934-07-04   66             Chemist
4      Rachel Carson  1907-05-27  1964-04-14   56           Biologist
6        Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7       Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [65]:
#데이터 프레임 브로드캐스팅
scientists * 2 #문자열은 반복

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

# 시리즈와 데이터프레임의 데이터 처리

In [70]:
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)

object
object

In [79]:
#자료형 변경
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
print(born_datetime)

died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(died_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]
0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [74]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [87]:
#새로운 열 추가
scientists['born_dt'] = scientists['Born']
scientists['died_dt'] = scientists['Died']
(scientists['born_date'], scientists['died_date']) = (born_datetime, died_datetime)

scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,born_date,died_date
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,1777-04-30,1855-02-23

In [91]:
#데이터프레임 행과 열 삭제
#axis = 0 : 인덱스로 삭제(행방향)
#axis = 1 : 레이블로 삭제(열방향)
print(scientists.columns)
scientists_dropped = scientists.drop(['Age'], axis=1)
print(scientists_dropped.columns)

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'born_date', 'died_date'],
      dtype='object')
Index(['Name', 'Born', 'Died', 'Occupation', 'born_dt', 'died_dt', 'born_date',
       'died_date'],
      dtype='object')

In [96]:
print(scientists.index)
scientists_dropped = scientists.drop([0], axis=0)
print(scientists_dropped.index)

RangeIndex(start=0, stop=8, step=1)
Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')

# 데이터 저장하고 불러오기

In [ ]:
#피클 : 데이터를 바이너리 형태로 직렬화한 오브젝트를 저장하는 방법 => 작은 용량
#바이너리 파일은 열어 볼 수 없고 단순히 저장, 읽어오기만 가능
#to_pickle(), read_pickle()

In [101]:
names = scientists['Name']
names

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [103]:
names.to_pickle('files/scientists_names_seriese.pickle')

In [105]:
scientists_names_from_pickle = pd.read_pickle('files/scientists_names_seriese.pickle')
scientists_names_from_pickle

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [107]:
scientists.to_pickle('files/scientists_df.pickle')

scientists_from_pickle = pd.read_pickle('files/scientists_df.pickle')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [108]:
#csv : 쉼표 구분
#tsv : 탭 구분
names.to_csv('files/scientist_names_series.csv')
scientists.to_csv('files/scientists_df.tsv', sep='\t')
scientists.to_csv('files/scientists_df.csv', index=False)

In [110]:
#엑셀 => openpyxl(xls는 warnning)
!pip list

Package                       Version
----------------------------- -------------------
alabaster                     0.7.12
appdirs                       1.4.4
argh                          0.26.2
astroid                       2.5
async-generator               1.10
atomicwrites                  1.4.0
attrs                         20.3.0
autopep8                      1.5.6
Babel                         2.9.0
backcall                      0.2.0
bcrypt                        3.2.0
beautifulsoup4                4.9.3
black                         19.10b0
bleach                        3.3.0
brotlipy                      0.7.0
bs4                           0.0.1
certifi                       2020.12.5
cffi                          1.14.5
chardet                       4.0.0
click                         7.1.2
cloudpickle                   1.6.0
colorama                      0.4.4
cryptography                  3.4.7
cx-Oracle                     8.1.0
cycler                        0.10.0
decorator                     5.0.3
defusedxml                    0.7.1
diff-match-patch              20200713
docutils                      0.16
entrypoints                   0.3
et-xmlfile                    1.0.1
flake8                        3.9.0
future                        0.18.2
greenlet                      1.0.0
idna                          2.10
imagesize                     1.2.0
importlib-metadata            3.7.3
intervaltree                  3.1.0
ipykernel                     5.3.4
ipython                       7.22.0
ipython-genutils              0.2.0
isort                         5.8.0
jedi                          0.17.2
Jinja2                        2.11.3
jsonschema                    3.2.0
jupyter-client                6.1.12
jupyter-core                  4.7.1
jupyterlab-pygments           0.1.2
keyring                       22.3.0
kiwisolver                    1.3.1
lazy-object-proxy             1.6.0
MarkupSafe                    1.1.1
matplotlib                    3.3.4
mccabe                        0.6.1
mistune                       0.8.4
mkl-fft                       1.3.0
mkl-random                    1.1.1
mkl-service                   2.3.0
mypy-extensions               0.4.3
nbclient                      0.5.3
nbconvert                     6.0.7
nbformat                      5.1.3
nest-asyncio                  1.5.1
numpy                         1.19.2
numpydoc                      1.1.0
olefile                       0.46
openpyxl                      3.0.7
packaging                     20.9
pandas                        1.2.3
pandocfilters                 1.4.3
paramiko                      2.7.2
parso                         0.7.0
pathspec                      0.7.0
pexpect                       4.8.0
pickleshare                   0.7.5
Pillow                        8.2.0
pip                           21.0.1
pluggy                        0.13.1
prompt-toolkit                3.0.17
psutil                        5.8.0
ptyprocess                    0.7.0
pycodestyle                   2.6.0
pycparser                     2.20
pydocstyle                    6.0.0
pyflakes                      2.2.0
Pygments                      2.8.1
pylint                        2.7.4
pyls-black                    0.4.6
pyls-spyder                   0.3.2
PyNaCl                        1.4.0
pyOpenSSL                     20.0.1
pyparsing                     2.4.7
pyrsistent                    0.17.3
PySocks                       1.7.1
python-dateutil               2.8.1
python-jsonrpc-server         0.4.0
python-language-server        0.36.2
pytz                          2021.1
pywin32                       227
pywin32-ctypes                0.2.0
PyYAML                        5.4.1
pyzmq                         20.0.0
QDarkStyle                    2.8.1
QtAwesome                     1.0.2
qtconsole                     5.0.3
QtPy                          1.9.0
regex                         2021.3.17
requests                      2.25.1
rope                          0.18.0
Rtree                         0.9.4
scipy                         1.6.2
seaborn                       0.11.1
selenium                      3.141.0
setuptools                    52.0.0.post20210125
six                           1.15.0
snowballstemmer               2.1.0
sortedcontainers              2.3.0
soupsieve                     2.2.1
Sphinx                        3.5.3
sphinxcontrib-applehelp       1.0.2
sphinxcontrib-devhelp         1.0.2
sphinxcontrib-htmlhelp        1.0.3
sphinxcontrib-jsmath          1.0.1
sphinxcontrib-qthelp          1.0.3
sphinxcontrib-serializinghtml 1.1.4
spyder                        4.2.5
spyder-kernels                1.10.2
SQLAlchemy                    1.4.7
testpath                      0.4.4
textdistance                  4.2.1
three-merge                   0.1.1
toml                          0.10.2
tornado                       6.1
traitlets                     5.0.5
typed-ast                     1.4.2
typing-extensions             3.7.4.3
ujson                         4.0.2
urllib3                       1.26.4
watchdog                      1.0.2
wcwidth                       0.2.5
webencodings                  0.5.1
wheel                         0.36.2
win-inet-pton                 1.1.0
wincertstore                  0.2
wrapt                         1.12.1
xlrd                          2.0.1
xlwt                          1.3.0
yapf                          0.31.0
zipp                          3.4.1

In [113]:
names_df = names.to_frame()
names_df

                   Name
0     Rosaline Franklin
1        William Gosset
2  Florence Nightingale
3           Marie Curie
4         Rachel Carson
5             John Snow
6           Alan Turing
7          Johann Gauss

In [116]:
import openpyxl
names_df.to_excel('files/scientist_names_series_df.xlsx')